In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
Popular_Baby_Names=pd.read_csv('C:/Users/enoch/OneDrive/Desktop/GOMYCODE/Popular_Baby_Names.csv')
Popular_Baby_Names.head()

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42
3           2011  FEMALE  HISPANIC            GISELLE     38    51
4           2011  FEMALE  HISPANIC              GRACE     36    53

In [3]:
Popular_Baby_Names.tail()

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
69209,2012,MALE,BLACK NON HISP,CAYDEN,19,52
69210,2013,FEMALE,WHITE NON HISPANIC,Margaret,25,67
69211,2013,FEMALE,WHITE NON HISPANIC,Tamar,10,82
69212,2013,FEMALE,WHITE NON HISPANIC,Amanda,13,79
69213,2012,FEMALE,HISPANIC,ANNA,10,79

In [4]:
Popular_Baby_Names.shape

(69214, 6)

In [5]:
Popular_Baby_Names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69214 entries, 0 to 69213
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year of Birth       69214 non-null  int64
 1   Gender              69214 non-null  object
 2   Ethnicity           69214 non-null  object
 3   Child's First Name  69214 non-null  object
 4   Count               69214 non-null  int64
 5   Rank                69214 non-null  int64
dtypes: int64(3), object(3)
memory usage: 3.2+ MB

In [6]:
Popular_Baby_Names.describe()

       Year of Birth         Count          Rank
count   69214.000000  69214.000000  69214.000000
mean     2013.565839     33.779365     56.746366
std         2.518639     38.825940     25.499777
min      2011.000000     10.000000      1.000000
25%      2012.000000     13.000000     37.000000
50%      2013.000000     20.000000     58.000000
75%      2014.000000     36.000000     78.000000
max      2021.000000    446.000000    102.000000

In [8]:
#Check for null values
Popular_Baby_Names.isnull().any()

Year of Birth         False
Gender                False
Ethnicity             False
Child's First Name    False
Count                 False
Rank                  False
dtype: bool

In [9]:
#Check for null values
Popular_Baby_Names.isnull().sum()

Year of Birth         0
Gender                0
Ethnicity             0
Child's First Name    0
Count                 0
Rank                  0
dtype: int64

In [10]:
#duplicated values 
Popular_Baby_Names.duplicated().sum()

47602

In [11]:
Popular_Baby_Names[Popular_Baby_Names.duplicated()]

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
545,2011,FEMALE,WHITE NON HISPANIC,SCARLETT,31,60
774,2011,FEMALE,WHITE NON HISPANIC,SERENA,16,75
810,2011,FEMALE,WHITE NON HISPANIC,SHAINA,16,75
880,2011,FEMALE,WHITE NON HISPANIC,SHAINDEL,15,76
1052,2011,FEMALE,WHITE NON HISPANIC,SHAINDY,48,44
...,...,...,...,...,...,...
69209,2012,MALE,BLACK NON HISP,CAYDEN,19,52
69210,2013,FEMALE,WHITE NON HISPANIC,Margaret,25,67
69211,2013,FEMALE,WHITE NON HISPANIC,Tamar,10,82
69212,2013,FEMALE,WHITE NON HISPANIC,Amanda,13,79
69213,2012,FEMALE,HISPANIC,ANNA,10,79

In [17]:
Popular_Baby_Names[Popular_Baby_Names.Rank==60]

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
20,2011,FEMALE,HISPANIC,ISABEL,28,60
99,2011,FEMALE,HISPANIC,LILIANA,28,60
441,2011,FEMALE,WHITE NON HISPANIC,MILA,31,60
492,2011,FEMALE,WHITE NON HISPANIC,SCARLETT,31,60
526,2011,FEMALE,WHITE NON HISPANIC,VALENTINA,31,60
...,...,...,...,...,...,...
69053,2014,MALE,HISPANIC,Damian,49,60
69076,2014,MALE,BLACK NON HISPANIC,Angel,10,60
69155,2011,MALE,BLACK NON HISPANIC,TIMOTHY,14,60
69183,2014,MALE,BLACK NON HISPANIC,Amare,10,60
69198,2011,MALE,WHITE NON HISPANIC,SOLOMON,48,60

In [18]:
Popular_Baby_Names.columns

Index(['Year of Birth', 'Gender', 'Ethnicity', 'Child's First Name', 'Count',
       'Rank'],
      dtype='object')

### Assessing Summary
    There is no column with missing values
    We have 47,602 rows in the dataset that is duplicated

### Cleaning
    We need only 60,000 rows from the 69,214 rows in the dataset
    We will handle and drop duplicates

In [21]:
new_df=Popular_Baby_Names

In [22]:
## Handle the duplicates values
new_df.drop_duplicates(inplace=True)

In [23]:
new_df.duplicated().sum()

0

In [24]:
new_df.isnull().sum()

Year of Birth         0
Gender                0
Ethnicity             0
Child's First Name    0
Count                 0
Rank                  0
dtype: int64

In [25]:
## save
new_df.to_csv('Popular_Baby_Names_cleaned.csv', index=False)

In [27]:
Popular_Baby_Names['Gender']=Popular_Baby_Names['Gender'].apply(lambda x:x.title())

In [28]:
Popular_Baby_Names['Ethnicity']=Popular_Baby_Names['Ethnicity'].apply(lambda x:x.title())

In [35]:
Popular_Baby_Names.head()

   Year of Birth  Gender Ethnicity Child_Name  Count  Rank
0           2011  Female  Hispanic  Geraldine     13    75
1           2011  Female  Hispanic        Gia     21    67
2           2011  Female  Hispanic     Gianna     49    42
3           2011  Female  Hispanic    Giselle     38    51
4           2011  Female  Hispanic      Grace     36    53

In [33]:
#columns rename
Popular_Baby_Names.rename(columns={'Child\'s First Name':'Child_Name'},inplace=True)

In [34]:
Popular_Baby_Names['Child_Name']=Popular_Baby_Names['Child_Name'].apply(lambda x:x.title())